aheadtest/4.12.14.20200820_native/fio_1Mrandread1.log
test: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=10883: Thu Nov  5 10:49:54 2020
   read: IOPS=102, BW=102MiB/s (107MB/s)(59.9GiB/600010msec)
    clat (usec): min=9576, max=14332, avg=9720.57, stdev=41.55
     lat (usec): min=9577, max=14334, avg=9722.02, stdev=41.55
    clat percentiles (usec):
     |  1.00th=[ 9634],  5.00th=[ 9634], 10.00th=[ 9634], 20.00th=[ 9634],
     | 30.00th=[ 9765], 40.00th=[ 9765], 50.00th=[ 9765], 60.00th=[ 9765],
     | 70.00th=[ 9765], 80.00th=[ 9765], 90.00th=[ 9765], 95.00th=[ 9765],
     | 99.00th=[ 9765], 99.50th=[ 9896], 99.90th=[ 9896], 99.95th=[10159],
     | 99.99th=[10683]
   bw (  KiB/s): min=36864, max=106496, per=100.00%, avg=105163.81, stdev=2354.41, samples=1195
   iops        : min=   36, max=  104, avg=102.65, stdev= 2.31, samples=1195
  lat (msec)   : 10=99.93%, 20=0.07%
  cpu          : usr=0.06%, sys=4.18%, ctx=61716, majf=0, minf=3
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=61372,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=102MiB/s (107MB/s), 102MiB/s-102MiB/s (107MB/s-107MB/s), io=59.9GiB (64.4GB), run=600010-600010msec