aheadtest/4.12.14.20200820_native/fio_1Mwrite1.log
test: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=11854: Thu Nov  5 11:33:18 2020
  write: IOPS=110, BW=110MiB/s (116MB/s)(64.7GiB/600001msec)
    clat (usec): min=409, max=19798, avg=8641.44, stdev=7220.06
     lat (usec): min=421, max=19817, avg=8660.44, stdev=7219.65
    clat percentiles (usec):
     |  1.00th=[  420],  5.00th=[  424], 10.00th=[  433], 20.00th=[  449],
     | 30.00th=[  519], 40.00th=[  603], 50.00th=[11600], 60.00th=[15664],
     | 70.00th=[15664], 80.00th=[15664], 90.00th=[15795], 95.00th=[15795],
     | 99.00th=[15795], 99.50th=[15795], 99.90th=[19792], 99.95th=[19792],
     | 99.99th=[19792]
   bw (  KiB/s): min=45056, max=2072576, per=100.00%, avg=118058.11, stdev=79394.71, samples=1149
   iops        : min=   44, max= 2024, avg=115.24, stdev=77.54, samples=1149
  lat (usec)   : 500=28.30%, 750=14.30%, 1000=0.34%
  lat (msec)   : 2=0.16%, 10=0.04%, 20=56.86%
  cpu          : usr=0.11%, sys=6.14%, ctx=41449, majf=0, minf=4
  IO depths    : 1=104.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,66300,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=110MiB/s (116MB/s), 110MiB/s-110MiB/s (116MB/s-116MB/s), io=64.7GiB (69.5GB), run=600001-600001msec