aheadtest/4.12.14.20200820_native/fio_4Krandread1.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=10626: Thu Nov  5 10:29:31 2020
   read: IOPS=6761, BW=26.4MiB/s (27.7MB/s)(15.5GiB/600001msec)
    clat (usec): min=128, max=205030, avg=140.90, stdev=102.57
     lat (usec): min=129, max=205032, avg=142.26, stdev=102.57
    clat percentiles (usec):
     |  1.00th=[  133],  5.00th=[  135], 10.00th=[  135], 20.00th=[  137],
     | 30.00th=[  139], 40.00th=[  139], 50.00th=[  141], 60.00th=[  141],
     | 70.00th=[  143], 80.00th=[  145], 90.00th=[  147], 95.00th=[  151],
     | 99.00th=[  159], 99.50th=[  165], 99.90th=[  178], 99.95th=[  208],
     | 99.99th=[  429]
   bw (  KiB/s): min=17792, max=27896, per=99.99%, avg=27041.54, stdev=399.20, samples=1199
   iops        : min= 4448, max= 6974, avg=6760.36, stdev=99.81, samples=1199
  lat (usec)   : 250=99.97%, 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 250=0.01%
  cpu          : usr=3.40%, sys=9.88%, ctx=4056804, majf=0, minf=842
  IO depths    : 1=100.8%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4056779,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=26.4MiB/s (27.7MB/s), 26.4MiB/s-26.4MiB/s (27.7MB/s-27.7MB/s), io=15.5GiB (16.6GB), run=600001-600001msec