aheadtest/4.12.14.20200820_native/fio_4Krandread32.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.7
Starting 32 processes

test: (groupid=0, jobs=32): err= 0: pid=10687: Thu Nov  5 10:39:42 2020
   read: IOPS=38.2k, BW=149MiB/s (156MB/s)(87.4GiB/600163msec)
    clat (nsec): min=977, max=211863k, avg=829932.63, stdev=524994.66
     lat (usec): min=2, max=211864, avg=831.45, stdev=525.00
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[ 1057], 40.00th=[ 1090], 50.00th=[ 1106], 60.00th=[ 1106],
     | 70.00th=[ 1106], 80.00th=[ 1123], 90.00th=[ 1123], 95.00th=[ 1156],
     | 99.00th=[ 1237], 99.50th=[ 1352], 99.90th=[ 1614], 99.95th=[ 1729],
     | 99.99th=[ 2040]
   bw (  KiB/s): min= 2112, max= 5496, per=3.13%, avg=4773.74, stdev=367.05, samples=38400
   iops        : min=  528, max= 1374, avg=1193.41, stdev=91.76, samples=38400
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 4=5.55%, 10=19.00%, 20=0.20%, 50=0.56%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.55%
  lat (msec)   : 2=74.12%, 4=0.01%, 10=0.01%, 20=0.01%, 250=0.01%
  cpu          : usr=0.62%, sys=1.73%, ctx=18100949, majf=51, minf=37198
  IO depths    : 1=100.6%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=22916490,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=149MiB/s (156MB/s), 149MiB/s-149MiB/s (156MB/s-156MB/s), io=87.4GiB (93.9GB), run=600163-600163msec