aheadtest/4.12.14.20200820_native/fio_4Kread1.log
test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.7
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=10918: Thu Nov  5 11:00:02 2020
   read: IOPS=28.3k, BW=111MiB/s (116MB/s)(64.8GiB/600050msec)
    clat (nsec): min=1467, max=523771k, avg=30046.29, stdev=1924311.24
     lat (usec): min=2, max=523772, avg=31.27, stdev=1924.31
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    4], 90.00th=[    4], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    5], 99.90th=[   17], 99.95th=[   23],
     | 99.99th=[96994]
   bw (  KiB/s): min= 6128, max=520208, per=100.00%, avg=113748.77, stdev=139786.85, samples=1195
   iops        : min= 1532, max=130052, avg=28437.18, stdev=34946.72, samples=1195
  lat (usec)   : 2=0.01%, 4=98.71%, 10=1.00%, 20=0.22%, 50=0.02%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=5.28%, sys=20.27%, ctx=10366, majf=0, minf=56
  IO depths    : 1=100.6%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16992965,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (116MB/s), 111MiB/s-111MiB/s (116MB/s-116MB/s), io=64.8GiB (69.6GB), run=600050-600050msec